<template>
	<div class="info-web">
		<p class="info-web__publishing-house">
			© 2020 Издательство «Статут»
		</p>
		<ul class="info-web__data">
			<li class="info-web__address">
				<a
					class="info-web__location-link"
					href=""
				><svg
					class="info-web__location"
					width="20"
					height="20"
					viewBox="0 0 20 20"
					fill="none"
					xmlns="http://www.w3.org/2000/svg"
				>
					<path
						fill-rule="evenodd"
						clip-rule="evenodd"
						d="M13.5844 9.87971L9.99999 15.7921L6.4156 9.87971C4.67707 7.01205 6.69702 3.30942 9.99999 3.30942C13.303 3.30942 15.3229 7.01205 13.5844 9.87971ZM5.04797 10.7442C2.64609 6.78238 5.43676 1.66699 9.99999 1.66699C14.5632 1.66699 17.3539 6.78238 14.952 10.7442L10.5356 18.029C10.2893 18.4352 9.71067 18.4352 9.46442 18.029L5.04797 10.7442ZM10.0002 5.77305C9.11181 5.77305 8.39167 6.50839 8.39167 7.41547C8.39167 8.32256 9.11181 9.0579 10.0002 9.0579C10.8885 9.0579 11.6086 8.32256 11.6086 7.41547C11.6086 6.50839 10.8885 5.77305 10.0002 5.77305Z"
						fill="#1C294D"
						fill-opacity="0.5"
					/>
				</svg>

					ул. Лобачевского, 92, корп. 2 119454, г. Москва</a>
			</li>
			<li class="info-web__address">
				Политика конфиденциальности
			</li>
			<li class="info-web__address">
				Договор оферты
			</li>
			<li class="info-web__li-adaptiv">
				<a
					class="info-web__link-adaptiv"
					href=""
				><svg
					width="20"
					height="20"
					viewBox="0 0 20 20"
					fill="none"
					xmlns="http://www.w3.org/2000/svg"
				>
					<path
						fill-rule="evenodd"
						clip-rule="evenodd"
						d="M5.24822 3.49769L5.24878 3.49839L5.24822 3.49769ZM5.28406 3.55396L6.9545 6.18607C6.75265 6.37559 6.53247 6.5633 6.29551 6.76533C6.09185 6.93896 5.87579 7.12316 5.64831 7.32816C5.08451 7.83626 4.97561 8.65343 5.3405 9.28938C7.27004 12.6523 9.9018 14.1825 11.0794 14.7319C11.7888 15.0629 12.5596 14.8017 12.9887 14.2608L14.1446 12.8037C14.1446 12.8037 14.1456 12.8029 14.1473 12.8026C14.1491 12.8023 14.1523 12.8026 14.1523 12.8026C14.1523 12.8026 14.1548 12.8031 14.1572 12.8046C14.8308 13.2163 15.7705 13.7758 16.6337 14.2494C16.4787 15.1763 16.1226 15.7163 15.7299 16.0463C15.3176 16.393 14.7844 16.5754 14.1897 16.6412C13.0023 16.7727 11.7968 16.416 11.5295 16.3291C11.2345 16.1797 9.61709 15.3366 7.88912 13.9704C6.10731 12.5616 4.32066 10.684 3.63734 8.53061C3.13796 6.95684 3.32626 5.8494 3.71877 5.0855C4.09821 4.34703 4.71224 3.84581 5.28406 3.55396ZM4.67978 1.99616C5.46698 1.62642 6.28098 2.01193 6.66013 2.60936L8.40765 5.36293C8.76094 5.91961 8.78516 6.73339 8.21082 7.29085C7.96467 7.52977 7.62221 7.82341 7.30354 8.09666C7.12861 8.24666 6.96085 8.39051 6.82012 8.51579C8.48078 11.3794 10.701 12.7043 11.7108 13.1888L12.8349 11.7718C13.3656 11.1028 14.3105 10.9464 15.0301 11.3862C15.6958 11.7931 16.6161 12.3407 17.4501 12.798C18.0063 13.1029 18.4042 13.7387 18.2914 14.4564C18.089 15.7456 17.5601 16.6846 16.8065 17.3181C16.0655 17.9411 15.1827 18.2054 14.3741 18.295C12.7836 18.4711 11.2623 17.9942 10.9845 17.902C10.9142 17.8787 10.8558 17.8541 10.7931 17.8225C10.4948 17.6725 8.73724 16.765 6.85136 15.2738C4.9851 13.7982 2.8804 11.6637 2.04539 9.03229C1.43204 7.09937 1.61348 5.53211 2.23262 4.32714C2.8409 3.1433 3.82598 2.39719 4.67978 1.99616Z"
						fill="#1C294D"
						fill-opacity="0.5"
					/>
					<path
						fill-rule="evenodd"
						clip-rule="evenodd"
						d="M12.2587 1.743C11.8397 1.55137 11.3441 1.73456 11.1518 2.15217C10.9595 2.56977 11.1433 3.06365 11.5624 3.25528C13.5011 4.14183 15.72 5.8086 16.7339 8.10862C16.9194 8.52929 17.4119 8.72049 17.834 8.53568C18.2562 8.35087 18.448 7.86003 18.2626 7.43937C17.024 4.62988 14.4061 2.72497 12.2587 1.743ZM11.6407 4.69451C11.2283 4.48903 10.7268 4.65561 10.5206 5.06657C10.3144 5.47754 10.4816 5.97726 10.894 6.18274C11.6784 6.57363 12.2214 6.94198 12.6597 7.37882C13.0981 7.81566 13.4677 8.3567 13.8599 9.13847C14.0661 9.54943 14.5676 9.71601 14.98 9.51053C15.3924 9.30505 15.5595 8.80532 15.3533 8.39435C14.9107 7.51223 14.4455 6.80536 13.8403 6.20227C13.2352 5.59918 12.5258 5.13558 11.6407 4.69451Z"
						fill="#1C294D"
						fill-opacity="0.5"
					/>
				</svg>
					8 (968) 660-65-50
					<svg
						width="20"
						height="20"
						viewBox="0 0 20 20"
						fill="none"
						xmlns="http://www.w3.org/2000/svg"
					>
						<path
							fill-rule="evenodd"
							clip-rule="evenodd"
							d="M10.0001 18.3337C5.39768 18.3337 1.66672 14.6027 1.66672 10.0003C1.66672 5.39795 5.39768 1.66699 10.0001 1.66699C14.6024 1.66699 18.3334 5.39795 18.3334 10.0003C18.3334 14.6027 14.6024 18.3337 10.0001 18.3337ZM10.0001 3.33366C6.31815 3.33366 3.33338 6.31843 3.33338 10.0003C3.33338 13.6822 6.31815 16.667 10.0001 16.667C13.6819 16.667 16.6667 13.6822 16.6667 10.0003C16.6667 6.31843 13.6819 3.33366 10.0001 3.33366ZM10.0001 8.95866C10.5753 8.95866 11.0417 9.42503 11.0417 10.0003V13.3337C11.0417 13.909 10.5753 14.3753 10.0001 14.3753C9.42475 14.3753 8.95838 13.909 8.95838 13.3337V10.0003C8.95838 9.42503 9.42475 8.95866 10.0001 8.95866ZM10.0001 5.83366C9.42475 5.83366 8.95838 6.30003 8.95838 6.87533C8.95838 7.45062 9.42475 7.91699 10.0001 7.91699C10.5753 7.91699 11.0417 7.45062 11.0417 6.87533C11.0417 6.30003 10.5753 5.83366 10.0001 5.83366Z"
							fill="#27AE60"
						/>
					</svg>
				</a>
			</li>
			<li class="info-web__li-adaptiv">
				<a
					class="info-web__link-adaptiv"
					href=""
				><svg
					width="22"
					height="20"
					viewBox="0 0 22 20"
					fill="none"
					xmlns="http://www.w3.org/2000/svg"
				>
					<path
						fill-rule="evenodd"
						clip-rule="evenodd"
						d="M4.16663 3.33301C2.78591 3.33301 1.66663 4.4523 1.66663 5.83301V14.1663C1.66663 15.5471 2.78591 16.6663 4.16663 16.6663H15.8333C17.214 16.6663 18.3333 15.5471 18.3333 14.1663V5.83301C18.3333 4.4523 17.214 3.33301 15.8333 3.33301H4.16663ZM3.40939 5.48462C3.5413 5.19837 3.83076 4.99967 4.16663 4.99967H15.8333C16.1692 4.99967 16.4586 5.19837 16.5905 5.48462L10.5116 10.2127C10.2107 10.4468 9.78927 10.4468 9.48834 10.2127L3.40939 5.48462ZM3.33329 7.53687V12.3871L6.3438 9.87838L3.33329 7.53687ZM3.40238 14.4991C3.53083 14.7937 3.82468 14.9997 4.16663 14.9997H15.8333C16.1752 14.9997 16.4691 14.7937 16.5975 14.4991L12.3095 10.9257L11.5348 11.5283C10.632 12.2304 9.36789 12.2304 8.46511 11.5283L7.6904 10.9257L3.40238 14.4991ZM16.6666 12.3871V7.53687L13.6561 9.87838L16.6666 12.3871Z"
						fill="#1C294D"
						fill-opacity="0.5"
					/>
				</svg>
					market@estatut.ru
				</a>
			</li>
		</ul>
	</div>
</template>

<style scoped>
	.info-web{
		display: flex;
		gap: 170px;
		margin: auto;
		padding: 45px 0px;
		margin-left: 113px;
		margin-right: 113px;
	}
	.info-web__data{
		display: flex;
		gap: 60px;
	}
	.info-web__address{
		font-family: Roboto;
		font-weight: 400;
		font-size: 14px;
		line-height: 20px;
		letter-spacing: 0px;
		text-align: center;
		color: rgba(28, 41, 77, 0.8);
	}
	.info-web__publishing-house{
		font-family: Roboto;
		font-weight: 400;
		font-size: 14px;
		line-height: 20px;
		letter-spacing: 0px;
		text-align: center;
		color: rgba(28, 41, 77, 0.8);
	}
	.info-web__li-adaptiv{
		display: none;
	}
	.info-web__link-adaptiv{
		display: none;
	}
	.info-web__location{
		display: none;
	}
	@media (max-width: 380px) {
		.info-web{
			flex-direction: column;
			margin-left: 0px;
			margin-right: 0px;
			gap: 0px;
			padding: 0px;
		}
		.info-web__data{
			flex-direction: column;
			order: -1;
			gap: 0px;
		}
		.info-web__address:not(:last-child){
			padding: 20px;
			text-align: left;
		}
		.info-web__address:first-child{
			order: 2;
			color:rgba(28, 41, 77, 1);
		}
		.info-web__li-adaptiv{
		display: flex;
        align-items: end;
        gap: 5px;
        font-family: Roboto;
        font-weight: 400;
        font-size: 14px;
        line-height: 20px;
        letter-spacing: 0px;
        color: rgba(40, 47, 54, 0.8);
		padding: 20px;
		border-bottom: 1px solid rgba(42, 61, 72, 0.15);
	}
	.info-web__link-adaptiv{
		display: flex;
		font-family: Roboto;
		font-weight: 400;
		font-size: 14px;
		line-height: 100%;
		letter-spacing: 0%;
		color: rgba(28, 41, 77, 1);
		align-items: center;
		gap: 5px;
	}
	.info-web__address{
		display: flex;
	}
	.info-web__address:not(:nth-child(2)){
		border-bottom: 1px solid rgba(42, 61, 72, 0.15);
	}
	.info-web__location{
		display: flex;
	}
	.info-web__location-link{
		display: flex;
		gap: 5px;
	}
	.info-web__publishing-house{
		padding: 20px;
		text-align: left;
	}
	.info-web__address:nth-child(2){
		padding-bottom: 10px;
		color:rgba(28, 41, 77, 0.5);
	}
	.info-web__address:nth-child(3){
		padding-top: 0px;
		color:rgba(28, 41, 77, 0.5);
		border-bottom: 1px solid rgba(42, 61, 72, 0.15);
	}
	.info-web__link-adaptiv:not(:first-child){
		color:rgba(28, 41, 77, 0.5);
	}
	}
</style>
